Revit 2027 API
StringParameterValue.Value Property
 The stored value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Value { get; set; }
Public Property Value As String
	Get
	Set
public:
property String^ Value {
	String^ get ();
	void set (String^ value);
}
member Value : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StringParameterValue Class
Autodesk.Revit.DB Namespace